# SQL Exercise

#### Load extension

In [1]:
%load_ext sql

#### Connect to database

In [2]:
%sql sqlite:///employee.db

#### Check tables in database

In [3]:
%sql SELECT name FROM sqlite_master WHERE type = 'table'

 * sqlite:///employee.db
Done.

[('employee_details',), ('salaries',), ('department',), ('performance',)]

#### Check for the content of each table.

In [4]:
%%sql 
SELECT * 
FROM employee_details;

 * sqlite:///employee.db
Done.

[(3001, 'Smith', 'Daniel', 'CEO', None),
 (3002, 'Bernard', 'Williams', 'CTO', None),
 (3003, 'Kane', 'Woods', 'Logistics Manager', 3001),
 (3004, 'Katty', 'Harris', 'Admin. Manager', 3001),
 (3005, 'Evelyn', 'Donald', 'Financial Analyst', 3001),
 (3006, 'Edward', 'Peters', 'Business Analyst', 3005),
 (3007, 'Caroline', 'Victor', 'Accountant', 3005),
 (3008, 'Roland', 'Cole', 'Software Developer', 3002),
 (3009, 'Dave', 'Roberts', 'Software Developer', 3002),
 (3010, 'Maria', 'Dylan', 'UI/UX Designer', 3002),
 (3011, 'Carlos', 'Junior', 'Data Analyst', 3002),
 (3012, 'Brenda', 'Marcus', 'Driver', 3004),
 (3013, 'Kate', 'John', 'Dispatch Rider', 3004),
 (3014, 'Wilberforce', 'Freeman', 'Dispatch Rider', 3004),
 (3015, 'Steffany', 'Baker', 'Dispatch Rider', 3004),
 (3016, 'Helen', 'Gilbert', 'Warehouse Staff', 3004),
 (3017, 'Kenneth', 'Mubarak', 'Warehouse Staff', 3004),
 (3018, 'Gareth', 'Dennis', 'Front Desk Officer', 3003),
 (3019, 'James', 'Cannon', 'Security', 3003),
 (3020, 'Azeez', 'Hakeem', 'Cleaner', 3003)]

In [5]:
%%sql 
SELECT * 
FROM salaries;

 * sqlite:///employee.db
Done.

[(3001, None),
 (3002, None),
 (3003, 400000),
 (3004, 400000),
 (3005, 450000),
 (3006, 400000),
 (3007, 400000),
 (3008, 400000),
 (3009, 350000),
 (3010, 300000),
 (3011, 300000),
 (3012, 180000),
 (3013, 150000),
 (3014, 150000),
 (3015, 150000),
 (3016, 120000),
 (3017, 120000),
 (3018, 120000),
 (3019, 100000),
 (3020, 100000)]

In [6]:
%%sql 
SELECT * 
FROM department;

 * sqlite:///employee.db
Done.

[(7001, 'Admin', 3003),
 (7002, 'Logistics', 3004),
 (7003, 'Finance', 3005),
 (7004, 'IT', 3002)]

In [7]:
%%sql 
SELECT * 
FROM performance;

 * sqlite:///employee.db
Done.

[(3001, None, 'January'),
 (3002, None, 'January'),
 (3003, 1, 'January'),
 (3004, 0.9, 'January'),
 (3005, 0.9, 'January'),
 (3006, 1, 'January'),
 (3007, 1, 'January'),
 (3008, 0.8, 'January'),
 (3009, 0.9, 'January'),
 (3010, 1, 'January'),
 (3011, 1, 'January'),
 (3012, 1, 'January'),
 (3013, 0.7, 'January'),
 (3014, 1, 'January'),
 (3015, 1, 'January'),
 (3016, 0.9, 'January'),
 (3017, 1, 'January'),
 (3018, 1, 'January'),
 (3019, 0.9, 'January'),
 (3020, 0.9, 'January'),
 (3001, None, 'February'),
 (3002, None, 'February'),
 (3003, 0.9, 'February'),
 (3004, 1, 'February'),
 (3005, 0.8, 'February'),
 (3006, 1, 'February'),
 (3007, 0.9, 'February'),
 (3008, 1, 'February'),
 (3009, 0.9, 'February'),
 (3010, 1, 'February'),
 (3011, 0.8, 'February'),
 (3012, 0.8, 'February'),
 (3013, 0.9, 'February'),
 (3014, 1, 'February'),
 (3015, 0.9, 'February'),
 (3016, 0.8, 'February'),
 (3017, 1, 'February'),
 (3018, 1, 'February'),
 (3019, 1, 'February'),
 (3020, 1, 'February'),
 (3001, None, 'March'),
 (3002, None, 'March'),
 (3003, 1, 'March'),
 (3004, 0.8, 'March'),
 (3005, 1, 'March'),
 (3006, 0.8, 'March'),
 (3007, 0.8, 'March'),
 (3008, 1, 'March'),
 (3009, 1, 'March'),
 (3010, 1, 'March'),
 (3011, 0.9, 'March'),
 (3012, 1, 'March'),
 (3013, 1, 'March'),
 (3014, 1, 'March'),
 (3015, 0.8, 'March'),
 (3016, 1, 'March'),
 (3017, 1, 'March'),
 (3018, 0.9, 'March'),
 (3019, 1, 'March'),
 (3020, 1, 'March')]

### General Inforamtion

The database dummies as a company's HR database holding various information about employees. The tables hold information as follows:

- ***`employee_details`*** - holds basic information about the employees. 
- ***`salaries`*** - holds each employee's salary information. 
- ***`department`*** - holds information about heads of department and the department managed by each of them. 
- ***`performance`*** - holds information about the monthly performance score of each employee. This table however contains information for only January to March.

## Queries Queries Queries!!!
Write queries to returns the different result sets shown below.

**Sort the *`employee_details`* table by the *`firstname`* column and return the first ten records.**

In [8]:
%%sql
SELECT *
FROM employee_details
ORDER BY firstname
LIMIT 10;

 * sqlite:///employee.db
Done.

[(3020, 'Azeez', 'Hakeem', 'Cleaner', 3003),
 (3002, 'Bernard', 'Williams', 'CTO', None),
 (3012, 'Brenda', 'Marcus', 'Driver', 3004),
 (3011, 'Carlos', 'Junior', 'Data Analyst', 3002),
 (3007, 'Caroline', 'Victor', 'Accountant', 3005),
 (3009, 'Dave', 'Roberts', 'Software Developer', 3002),
 (3006, 'Edward', 'Peters', 'Business Analyst', 3005),
 (3005, 'Evelyn', 'Donald', 'Financial Analyst', 3001),
 (3018, 'Gareth', 'Dennis', 'Front Desk Officer', 3003),
 (3016, 'Helen', 'Gilbert', 'Warehouse Staff', 3004)]

**What is the number of unique job roles the company has?**

In [9]:
%%sql
SELECT COUNT(DISTINCT(job_role)) AS 'no_of_job_roles'
FROM employee_details;

 * sqlite:///employee.db
Done.

[(16,)]

**Return records that contain the following firstnames: `Katty`, `Carlos`, `Wilberforce` and `Steffany`.**

In [10]:
%%sql
SELECT *
FROM employee_details
WHERE firstname IN ('Katty', 'Carlos', 'Wilberforce', 'Steffany');

 * sqlite:///employee.db
Done.

[(3004, 'Katty', 'Harris', 'Admin. Manager', 3001),
 (3011, 'Carlos', 'Junior', 'Data Analyst', 3002),
 (3014, 'Wilberforce', 'Freeman', 'Dispatch Rider', 3004),
 (3015, 'Steffany', 'Baker', 'Dispatch Rider', 3004)]

In [11]:
%%sql
SELECT *
FROM department;

 * sqlite:///employee.db
Done.

[(7001, 'Admin', 3003),
 (7002, 'Logistics', 3004),
 (7003, 'Finance', 3005),
 (7004, 'IT', 3002)]

In [12]:
%%sql
SELECT *
FROM employee_details
LIMIT 5;

 * sqlite:///employee.db
Done.

[(3001, 'Smith', 'Daniel', 'CEO', None),
 (3002, 'Bernard', 'Williams', 'CTO', None),
 (3003, 'Kane', 'Woods', 'Logistics Manager', 3001),
 (3004, 'Katty', 'Harris', 'Admin. Manager', 3001),
 (3005, 'Evelyn', 'Donald', 'Financial Analyst', 3001)]

**What are the names of the Department Heads, and the Departments they head?**

In [13]:
%%sql 
SELECT em.emp_id, em.firstname || ' ' || em.lastname AS fullname, dp.name
FROM employee_details AS em INNER JOIN department AS dp
ON em.emp_id = dp.manager_id
WHERE emp_id BETWEEN 3001 AND 3005;

 * sqlite:///employee.db
Done.

[(3003, 'Kane Woods', 'Admin'),
 (3004, 'Katty Harris', 'Logistics'),
 (3005, 'Evelyn Donald', 'Finance'),
 (3002, 'Bernard Williams', 'IT')]

**What is the *`fullname`* and  *`job_role`* of the Manager of the *`IT`* Department?**

In [14]:
%%sql
SELECT em.emp_id, em.firstname || ' ' || em.lastname AS fullname, dp.name, em.job_role 
FROM employee_details AS em INNER JOIN department dp
ON em.emp_id = dp.manager_id
WHERE emp_id == 3002;

 * sqlite:///employee.db
Done.

[(3002, 'Bernard Williams', 'IT', 'CTO')]

In [15]:
%%sql
SELECT * 
FROM salaries
LIMIT 5;

 * sqlite:///employee.db
Done.

[(3001, None), (3002, None), (3003, 400000), (3004, 400000), (3005, 450000)]

**How much do(es) the highest earning non-management staff(s) get?**

In [16]:
%%sql
SELECT MAX(salary) AS max_salary
FROM salaries
WHERE salary < 450000;

 * sqlite:///employee.db
Done.

[(400000,)]

**How many employees earn more than the average salary?**

In [17]:
%%sql
SELECT AVG(salary)
FROM salaries;

 * sqlite:///employee.db
Done.

[(255000.0,)]

In [18]:
%%sql
SELECT COUNT(salary) AS above_avg_earners
FROM salaries
WHERE salary > (SELECT AVG(salary) FROM salaries);

 * sqlite:///employee.db
Done.

[(9,)]

In [19]:
%%sql 
SELECT * 
FROM department
LIMIT 5;

 * sqlite:///employee.db
Done.

[(7001, 'Admin', 3003),
 (7002, 'Logistics', 3004),
 (7003, 'Finance', 3005),
 (7004, 'IT', 3002)]

In [20]:
%%sql 
SELECT * 
FROM performance
LIMIT 5;

 * sqlite:///employee.db
Done.

[(3001, None, 'January'),
 (3002, None, 'January'),
 (3003, 1, 'January'),
 (3004, 0.9, 'January'),
 (3005, 0.9, 'January')]

**What *`department`* has the most staff?**

In [21]:
%%sql
SELECT dp.name, COUNT(em.emp_id) AS no_of_staffs
FROM department AS dp INNER JOIN employee_details AS em
ON dp.manager_id = em.emp_id

 * sqlite:///employee.db
Done.

[('Admin', 4)]

In [22]:
%%sql
SELECT *
FROM salaries
LIMIT 5;

 * sqlite:///employee.db
Done.

[(3001, None), (3002, None), (3003, 400000), (3004, 400000), (3005, 450000)]

In [23]:
%%sql
SELECT *
FROM employee_details
LIMIT 5;

 * sqlite:///employee.db
Done.

[(3001, 'Smith', 'Daniel', 'CEO', None),
 (3002, 'Bernard', 'Williams', 'CTO', None),
 (3003, 'Kane', 'Woods', 'Logistics Manager', 3001),
 (3004, 'Katty', 'Harris', 'Admin. Manager', 3001),
 (3005, 'Evelyn', 'Donald', 'Financial Analyst', 3001)]

**How much does a *`Dispatch Rider`* earn?**

In [24]:
%%sql
SELECT em.job_role, sa.salary
FROM employee_details AS em INNER JOIN salaries AS sa
ON em.emp_id = sa.emp_id
WHERE job_role == 'Dispatch Rider';

 * sqlite:///employee.db
Done.

[('Dispatch Rider', 150000),
 ('Dispatch Rider', 150000),
 ('Dispatch Rider', 150000)]

In [25]:
%%sql
SELECT *
FROM department
LIMIT 5;

 * sqlite:///employee.db
Done.

[(7001, 'Admin', 3003),
 (7002, 'Logistics', 3004),
 (7003, 'Finance', 3005),
 (7004, 'IT', 3002)]

In [26]:
%%sql
SELECT *
FROM salaries
LIMIT 5;

 * sqlite:///employee.db
Done.

[(3001, None), (3002, None), (3003, 400000), (3004, 400000), (3005, 450000)]

In [27]:
%%sql
SELECT *
FROM employee_details
LIMIT 5;

 * sqlite:///employee.db
Done.

[(3001, 'Smith', 'Daniel', 'CEO', None),
 (3002, 'Bernard', 'Williams', 'CTO', None),
 (3003, 'Kane', 'Woods', 'Logistics Manager', 3001),
 (3004, 'Katty', 'Harris', 'Admin. Manager', 3001),
 (3005, 'Evelyn', 'Donald', 'Financial Analyst', 3001)]

In [28]:
%%sql 
SELECT *
FROM performance
LIMIT 5;

 * sqlite:///employee.db
Done.

[(3001, None, 'January'),
 (3002, None, 'January'),
 (3003, 1, 'January'),
 (3004, 0.9, 'January'),
 (3005, 0.9, 'January')]

**Taking aside Department Heads, what Department does the company expend the most salaries on?**

In [29]:
%%sql
SELECT dp.name, MAX(sa.salary) AS highest_salary_expended
FROM department AS dp INNER JOIN salaries AS sa
ON dp.manager_id = sa.emp_id

 * sqlite:///employee.db
Done.

[('Finance', 450000)]

**If salaries are multiplied by *`performance score`* every month to decide each staff's take-home per month, determine the take-home for January.**

In [30]:
%%sql
SELECT em.firstname, em.job_role, sa.salary * pf.score AS take_home, pf.month
FROM employee_details AS em INNER JOIN salaries AS sa ON em.emp_id = sa.emp_id
INNER JOIN performance AS pf ON em.emp_id = pf.emp_id
WHERE month == 'January';

 * sqlite:///employee.db
Done.

[('Smith', 'CEO', None, 'January'),
 ('Bernard', 'CTO', None, 'January'),
 ('Kane', 'Logistics Manager', 400000, 'January'),
 ('Katty', 'Admin. Manager', 360000.0, 'January'),
 ('Evelyn', 'Financial Analyst', 405000.0, 'January'),
 ('Edward', 'Business Analyst', 400000, 'January'),
 ('Caroline', 'Accountant', 400000, 'January'),
 ('Roland', 'Software Developer', 320000.0, 'January'),
 ('Dave', 'Software Developer', 315000.0, 'January'),
 ('Maria', 'UI/UX Designer', 300000, 'January'),
 ('Carlos', 'Data Analyst', 300000, 'January'),
 ('Brenda', 'Driver', 180000, 'January'),
 ('Kate', 'Dispatch Rider', 105000.0, 'January'),
 ('Wilberforce', 'Dispatch Rider', 150000, 'January'),
 ('Steffany', 'Dispatch Rider', 150000, 'January'),
 ('Helen', 'Warehouse Staff', 108000.0, 'January'),
 ('Kenneth', 'Warehouse Staff', 120000, 'January'),
 ('Gareth', 'Front Desk Officer', 120000, 'January'),
 ('James', 'Security', 90000.0, 'January'),
 ('Azeez', 'Cleaner', 90000.0, 'January')]

In [31]:
%%sql
SELECT *
FROM performance
LIMIT 5;

 * sqlite:///employee.db
Done.

[(3001, None, 'January'),
 (3002, None, 'January'),
 (3003, 1, 'January'),
 (3004, 0.9, 'January'),
 (3005, 0.9, 'January')]

**The average *`performance score`* for each *`employee`* through out the three month period.**

In [32]:
%%sql 
SELECT emp_id, score AS avg_score 
FROM performance;

 * sqlite:///employee.db
Done.

[(3001, None),
 (3002, None),
 (3003, 1),
 (3004, 0.9),
 (3005, 0.9),
 (3006, 1),
 (3007, 1),
 (3008, 0.8),
 (3009, 0.9),
 (3010, 1),
 (3011, 1),
 (3012, 1),
 (3013, 0.7),
 (3014, 1),
 (3015, 1),
 (3016, 0.9),
 (3017, 1),
 (3018, 1),
 (3019, 0.9),
 (3020, 0.9),
 (3001, None),
 (3002, None),
 (3003, 0.9),
 (3004, 1),
 (3005, 0.8),
 (3006, 1),
 (3007, 0.9),
 (3008, 1),
 (3009, 0.9),
 (3010, 1),
 (3011, 0.8),
 (3012, 0.8),
 (3013, 0.9),
 (3014, 1),
 (3015, 0.9),
 (3016, 0.8),
 (3017, 1),
 (3018, 1),
 (3019, 1),
 (3020, 1),
 (3001, None),
 (3002, None),
 (3003, 1),
 (3004, 0.8),
 (3005, 1),
 (3006, 0.8),
 (3007, 0.8),
 (3008, 1),
 (3009, 1),
 (3010, 1),
 (3011, 0.9),
 (3012, 1),
 (3013, 1),
 (3014, 1),
 (3015, 0.8),
 (3016, 1),
 (3017, 1),
 (3018, 0.9),
 (3019, 1),
 (3020, 1)]

**Which employee(s) had a perfect average score through the three month period?**

In [33]:
%%sql
SELECT em.emp_id, em.firstname, em.lastname, em.job_role, pf.score AS avg_score
FROM employee_details AS em INNER JOIN performance AS pf
ON em.emp_id = pf.emp_id
WHERE score == 1;

 * sqlite:///employee.db
Done.

[(3003, 'Kane', 'Woods', 'Logistics Manager', 1),
 (3006, 'Edward', 'Peters', 'Business Analyst', 1),
 (3007, 'Caroline', 'Victor', 'Accountant', 1),
 (3010, 'Maria', 'Dylan', 'UI/UX Designer', 1),
 (3011, 'Carlos', 'Junior', 'Data Analyst', 1),
 (3012, 'Brenda', 'Marcus', 'Driver', 1),
 (3014, 'Wilberforce', 'Freeman', 'Dispatch Rider', 1),
 (3015, 'Steffany', 'Baker', 'Dispatch Rider', 1),
 (3017, 'Kenneth', 'Mubarak', 'Warehouse Staff', 1),
 (3018, 'Gareth', 'Dennis', 'Front Desk Officer', 1),
 (3004, 'Katty', 'Harris', 'Admin. Manager', 1),
 (3006, 'Edward', 'Peters', 'Business Analyst', 1),
 (3008, 'Roland', 'Cole', 'Software Developer', 1),
 (3010, 'Maria', 'Dylan', 'UI/UX Designer', 1),
 (3014, 'Wilberforce', 'Freeman', 'Dispatch Rider', 1),
 (3017, 'Kenneth', 'Mubarak', 'Warehouse Staff', 1),
 (3018, 'Gareth', 'Dennis', 'Front Desk Officer', 1),
 (3019, 'James', 'Cannon', 'Security', 1),
 (3020, 'Azeez', 'Hakeem', 'Cleaner', 1),
 (3003, 'Kane', 'Woods', 'Logistics Manager', 1),
 (3005, 'Evelyn', 'Donald', 'Financial Analyst', 1),
 (3008, 'Roland', 'Cole', 'Software Developer', 1),
 (3009, 'Dave', 'Roberts', 'Software Developer', 1),
 (3010, 'Maria', 'Dylan', 'UI/UX Designer', 1),
 (3012, 'Brenda', 'Marcus', 'Driver', 1),
 (3013, 'Kate', 'John', 'Dispatch Rider', 1),
 (3014, 'Wilberforce', 'Freeman', 'Dispatch Rider', 1),
 (3016, 'Helen', 'Gilbert', 'Warehouse Staff', 1),
 (3017, 'Kenneth', 'Mubarak', 'Warehouse Staff', 1),
 (3019, 'James', 'Cannon', 'Security', 1),
 (3020, 'Azeez', 'Hakeem', 'Cleaner', 1)]

**What departments do these employees belong to?**

In [34]:
%%sql
SELECT em.emp_id, em.firstname, em.lastname, em.job_role, pf.score AS avg_score, dp.name
FROM employee_details AS em INNER JOIN performance AS pf ON em.emp_id = pf.emp_id
INNER JOIN department AS dp ON em.emp_id = dp.manager_id
WHERE score == 1;

 * sqlite:///employee.db
Done.

[(3003, 'Kane', 'Woods', 'Logistics Manager', 1, 'Admin'),
 (3004, 'Katty', 'Harris', 'Admin. Manager', 1, 'Logistics'),
 (3003, 'Kane', 'Woods', 'Logistics Manager', 1, 'Admin'),
 (3005, 'Evelyn', 'Donald', 'Financial Analyst', 1, 'Finance')]

---